## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_mdm_artifact.mscp-firewall will be created
  + resource "zentral_mdm_artifact" "mscp-firewall" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - firewall"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_blueprint_artifact.mscp-firewall will be created
  + resource "zentral_mdm_blueprint_artifact" "mscp-firewall" {
      + artifact_id        = (known after apply)
      + blueprint_id       = 1
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>